FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетЗапрос</Name>
					<Comment>Интернет-запрос</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мойка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыСобытий/Ext/ManagerModule.bsl
//возвращает по значению перечисления картинку из библиотеки                
Функция ПолучитьИмяКартинки(ВыбЗначение) Экспорт
	
	Если ТипЗнч(ВыбЗначение) <> ТипЗнч(Перечисления.ВидыСобытий.ПустаяСсылка()) Тогда
		Возврат "ПрочееСобытие";
	КонецЕсли;
	
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.Анкетирование, 			"Клиенты16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ВыдачаАвтомобиля, 		"АвтомобильВыдача16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ЗаменаАвтомобиля, 		"Автосалон16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ЛичнаяВстреча, 			"СобытияВстреча16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ОтказОтАвтомобиля, 		"АвтомобильОтказ16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ПереуступкаАвтомобиля, 	"АвтомобильПодбор16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ПочтовоеПисьмо, 			"КонтактнаяИнформацияДругое");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.Прочее, 					"ПрочееСобытие");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ТелефонныйЗвонок, 		"СобытияЗвонок16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ТестДрайв, 				"АвтомобильТестДрайв16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ЭлектронноеПисьмо, 		"КонтактнаяИнформацияЭлектроннаяПочта");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.SMS, 					"СобытияSMS16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ИнтернетЗапрос, 			"КонтактнаяИнформацияВебСтраница");
	
 	ИмяКартинки = СоответствиеКартинки.Получить(ВыбЗначение);
	Если ИмяКартинки = Неопределено Тогда
		Возврат "ПрочееСобытие";
	КонецЕсли;
	
	Возврат ИмяКартинки;
КонецФункции


//возвращает список элементов перечисления 
#Если Клиент Тогда
Функция ПолучитьСписокЭлементовПеречисления() Экспорт
	Список = Новый СписокЗначений;

	//Для Каждого ТекПеречисление Из Метаданные.Перечисления.ВидыСобытий.ЗначенияПеречисления Цикл
	//	ТекЗначение = Перечисления.ВидыСобытий[ТекПеречисление.Имя];
	//	Список.Добавить(ТекЗначение,ТекПеречисление.Синоним,,ПолучитьКартинкуСобытия(ТекЗначение));	
	//КонецЦикла;
	
	//перегруппируем события
	Список.Добавить(Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ЗаменаАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ОтказОтАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ПереуступкаАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ТестДрайв);
	Список.Добавить(Перечисления.ВидыСобытий.Анкетирование);
	Список.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча);
	Список.Добавить(Перечисления.ВидыСобытий.ПочтовоеПисьмо);
	Список.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	Список.Добавить(Перечисления.ВидыСобытий.ЭлектронноеПисьмо);
	Список.Добавить(Перечисления.ВидыСобытий.SMS);
	Список.Добавить(Перечисления.ВидыСобытий.ИнтернетЗапрос);
	Список.Добавить(Перечисления.ВидыСобытий.Прочее);
	
	Для Каждого ТекВид Из Список Цикл
		ТекВид.Представление = СокрЛП(Строка(ТекВид.Значение));
		ИмяКартинки = ПолучитьИмяКартинки(ТекВид.Значение);
		ТекВид.Картинка = БиблиотекаКартинок[ИмяКартинки];
	КонецЦикла;
	
	Возврат Список;
КонецФункции
#КонецЕсли
